In [1]:
import matplotlib.pyplot as plt
import octave_kernel
import scipy.stats as st
import seaborn as sns
import pandas as pd

In [12]:
import pandas as pd
import numpy as np
data = {'Name': ['John','Paul', np.NaN, 'Wale', 'Mary', 'Carli', 'Steve'],
'Age': [21,23,np.nan,19,25,np.nan,15],
'Sex': ['M',np.nan,np.nan,'M','F','F','M'],
'Goals': [5,10,np.nan,19,5,0,7],
'Value': [55,84,np.nan,90,63,15,46]}
df=pd.DataFrame(data, columns =['Name','Age','Sex',
'Goals', 'Assists', 'Value'])
print(df.dropna(how = 'any'))
df.dropna(how = 'any')

Empty DataFrame
Columns: [Name, Age, Sex, Goals, Assists, Value]
Index: []

Empty DataFrame
Columns: [Name, Age, Sex, Goals, Assists, Value]
Index: []

In [3]:
import pandas as pd
import numpy as np
data = {'Name': ['John','Paul', np.NaN, 'Wale', 'Mary', 'Carli', 'Steve'],
'Age': [21,23,np.nan,19,25,np.nan,15],
'Sex': ['M',np.nan,np.nan,'M','F','F','M'],
'Goals': [5,10,np.nan,19,5,0,7],
'Value': [55,84,np.nan,90,63,15,46]}
df=pd.DataFrame(data, columns =['Name','Age','Sex',
'Goals', 'Assists', 'Value'])
print(df.dropna(how = 'all'))
df.dropna(how = 'all')

    Name   Age  Sex  Goals Assists  Value
0   John  21.0    M    5.0     NaN   55.0
1   Paul  23.0  NaN   10.0     NaN   84.0
3   Wale  19.0    M   19.0     NaN   90.0
4   Mary  25.0    F    5.0     NaN   63.0
5  Carli   NaN    F    0.0     NaN   15.0
6  Steve  15.0    M    7.0     NaN   46.0

    Name   Age  Sex  Goals Assists  Value
0   John  21.0    M    5.0     NaN   55.0
1   Paul  23.0  NaN   10.0     NaN   84.0
3   Wale  19.0    M   19.0     NaN   90.0
4   Mary  25.0    F    5.0     NaN   63.0
5  Carli   NaN    F    0.0     NaN   15.0
6  Steve  15.0    M    7.0     NaN   46.0

In [4]:
df.dropna(how='all')

    Name   Age  Sex  Goals Assists  Value
0   John  21.0    M    5.0     NaN   55.0
1   Paul  23.0  NaN   10.0     NaN   84.0
3   Wale  19.0    M   19.0     NaN   90.0
4   Mary  25.0    F    5.0     NaN   63.0
5  Carli   NaN    F    0.0     NaN   15.0
6  Steve  15.0    M    7.0     NaN   46.0

In [5]:
import pandas as pd
import numpy as np
data = {'Name': ['John','Paul', np.NaN, 'Wale', 'Mary', 'Carli', 'Steve'],
'Age': [21,23,np.nan,19,25,np.nan,15],
'Sex': ['M',np.nan,np.nan,'M','F','F','M'],
'Goals': [5,10,np.nan,19,5,0,7],
'Value': [55,84,np.nan,90,63,15,46]}
df=pd.DataFrame(data, columns =['Name','Age','Sex',
'Goals', 'Assists', 'Value'])
print(df.dropna(axis = 1, how = 'all'))
df.dropna(axis = 1, how = 'all')

    Name   Age  Sex  Goals  Value
0   John  21.0    M    5.0   55.0
1   Paul  23.0  NaN   10.0   84.0
2    NaN   NaN  NaN    NaN    NaN
3   Wale  19.0    M   19.0   90.0
4   Mary  25.0    F    5.0   63.0
5  Carli   NaN    F    0.0   15.0
6  Steve  15.0    M    7.0   46.0

    Name   Age  Sex  Goals  Value
0   John  21.0    M    5.0   55.0
1   Paul  23.0  NaN   10.0   84.0
2    NaN   NaN  NaN    NaN    NaN
3   Wale  19.0    M   19.0   90.0
4   Mary  25.0    F    5.0   63.0
5  Carli   NaN    F    0.0   15.0
6  Steve  15.0    M    7.0   46.0

In [6]:
df['New'] = np.nan

In [9]:
print(df)

    Name   Age  Sex  Goals Assists  Value  New
0   John  21.0    M    5.0     NaN   55.0  NaN
1   Paul  23.0  NaN   10.0     NaN   84.0  NaN
2    NaN   NaN  NaN    NaN     NaN    NaN  NaN
3   Wale  19.0    M   19.0     NaN   90.0  NaN
4   Mary  25.0    F    5.0     NaN   63.0  NaN
5  Carli   NaN    F    0.0     NaN   15.0  NaN
6  Steve  15.0    M    7.0     NaN   46.0  NaN

In [14]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer
data = {'Name': ['John','Paul', np.NaN, 'Wale', 'Mary', 'Carli', 'Steve'],
'Age': [21,23,np.nan,19,25,np.nan,15],
'Sex': ['M',np.nan,np.nan,'M','F','F','M'],
'Goals': [5,10,np.nan,19,5,0,7],
'Assists': [7,4,np.nan,9,7,6,4],
'Value': [55,84,np.nan,90,63,15,46]}
df=pd.DataFrame(data, columns =['Name','Age','Sex', 'Goals', 'Assists', 'Value'])
imputer = SimpleImputer(missing_values = 'NaN', strategy = 'mean', axis = 0, verbose = True)
transformed_values = imputer.fit_transform(data)
df_new = pd.DataFrame(transformed_values, columns =['Age','Goals', 'Assists', 'Value'])
print(df_new)
df_new

TypeError: __init__() got an unexpected keyword argument 'axis'